//-----------------------------------------------------------------------------
// F33x_IDA0_SineWave.c
//-----------------------------------------------------------------------------
// 版权所有 2006 Silicon Laboratories, Inc.
// http://www.silabs.com
//
// 程序说明：
//
// 本程序使用 IDA0 输出正弦波。IDA0 的输出更新速率由常量
// <SAMPLE_RATE_DAC> 决定，并由 Timer3 管理和定时。
//
// 实现了一个 256 项、全周期、16 位精度的正弦查找表。
//
// 输出频率由 16 位相位加法器决定。
// 在每个 DAC 更新周期，相位加法器的值累加到运行的
// 相位累加器 <phase_accumulator> 中，其高位用于
// 访问正弦查找表。
//
// 如何测试：
//
// 1) 在 C8051F330 目标板上运行代码
// 2) 使用示波器观察 P0.1 上的 IDAC 输出，
//    并验证有一个峰峰值为 500 mV 的正弦波
//
//
// FID:            33X000016
// 目标：          C8051F330 目标板
// 工具链：        Keil C51 7.50 / Keil EVAL C51
// 命令行：        无
//
//
// 版本 1.0
//    -初始版本 (GP)
//    -2006年5月22日
    
//-----------------------------------------------------------------------------
// 包含文件
//-----------------------------------------------------------------------------

#include <c8051f350.h>                 // SFR 声明

//-----------------------------------------------------------------------------
// 'F33x 的 16 位 SFR 定义
//-----------------------------------------------------------------------------

sfr16 TMR3RL   = 0x92;                 // 启用计时器3重载值(便于后续快速调整计时时间)
sfr16 TMR3     = 0x94;                 // 启用计时器3
sfr16 IDA0     = 0x96;                 // IDA0 数据

//-----------------------------------------------------------------------------
// 函数原型
//-----------------------------------------------------------------------------

void main (void);
void OSCILLATOR_Init (void);
void PORT_Init (void);
void IDA0_Init (void);

void Timer3_Init (int counts);
void Timer3_ISR (void);

//-----------------------------------------------------------------------------
// 类型定义
//-----------------------------------------------------------------------------

typedef union lng {                    // 将一个 long 变量作为两个
      long Long;                       // 16 位整数值访问
      int Int[2];
   } lng;

//-----------------------------------------------------------------------------
// 全局常量
//-----------------------------------------------------------------------------

#define SYSCLK          24500000       // SYSCLK 频率，单位 Hz

#define SAMPLE_RATE_DAC 100000L        // DAC 采样率，单位 Hz(设置为long,频率100000Hz)

#define PHASE_PRECISION 65536          // 相位累加器的范围

#define FREQUENCY       1000L          // 输出频率，单位 Hz

#define PHASE_ADD       (FREQUENCY * PHASE_PRECISION / SAMPLE_RATE_DAC)

#define AMPLITUDE       100 * 655      // 655 是缩放因子
                                       // 参见 Timer3 中断服务程序

//-----------------------------------------------------------------------------
// 全局变量
//-----------------------------------------------------------------------------

// 一个全周期、16 位、二进制补码正弦波查找表
int code SINE_TABLE[256] = {

   0x0000, 0x0324, 0x0647, 0x096a, 0x0c8b, 0x0fab, 0x12c8, 0x15e2, 
   0x18f8, 0x1c0b, 0x1f19, 0x2223, 0x2528, 0x2826, 0x2b1f, 0x2e11,
   0x30fb, 0x33de, 0x36ba, 0x398c, 0x3c56, 0x3f17, 0x41ce, 0x447a, 
   0x471c, 0x49b4, 0x4c3f, 0x4ebf, 0x5133, 0x539b, 0x55f5, 0x5842,
   0x5a82, 0x5cb4, 0x5ed7, 0x60ec, 0x62f2, 0x64e8, 0x66cf, 0x68a6, 
   0x6a6d, 0x6c24, 0x6dca, 0x6f5f, 0x70e2, 0x7255, 0x73b5, 0x7504,
   0x7641, 0x776c, 0x7884, 0x798a, 0x7a7d, 0x7b5d, 0x7c29, 0x7ce3, 
   0x7d8a, 0x7e1d, 0x7e9d, 0x7f09, 0x7f62, 0x7fa7, 0x7fd8, 0x7ff6,
   0x7fff, 0x7ff6, 0x7fd8, 0x7fa7, 0x7f62, 0x7f09, 0x7e9d, 0x7e1d, 
   0x7d8a, 0x7ce3, 0x7c29, 0x7b5d, 0x7a7d, 0x798a, 0x7884, 0x776c,
   0x7641, 0x7504, 0x73b5, 0x7255, 0x70e2, 0x6f5f, 0x6dca, 0x6c24, 
   0x6a6d, 0x68a6, 0x66cf, 0x64e8, 0x62f2, 0x60ec, 0x5ed7, 0x5cb4,
   0x5a82, 0x5842, 0x55f5, 0x539b, 0x5133, 0x4ebf, 0x4c3f, 0x49b4, 
   0x471c, 0x447a, 0x41ce, 0x3f17, 0x3c56, 0x398c, 0x36ba, 0x33de,
   0x30fb, 0x2e11, 0x2b1f, 0x2826, 0x2528, 0x2223, 0x1f19, 0x1c0b, 
   0x18f8, 0x15e2, 0x12c8, 0x0fab, 0x0c8b, 0x096a, 0x0647, 0x0324,
   0x0000, 0xfcdc, 0xf9b9, 0xf696, 0xf375, 0xf055, 0xed38, 0xea1e, 
   0xe708, 0xe3f5, 0xe0e7, 0xdddd, 0xdad8, 0xd7da, 0xd4e1, 0xd1ef,
   0xcf05, 0xcc22, 0xc946, 0xc674, 0xc3aa, 0xc0e9, 0xbe32, 0xbb86, 
   0xb8e4, 0xb64c, 0xb3c1, 0xb141, 0xaecd, 0xac65, 0xaa0b, 0xa7be,
   0xa57e, 0xa34c, 0xa129, 0x9f14, 0x9d0e, 0x9b18, 0x9931, 0x975a, 
   0x9593, 0x93dc, 0x9236, 0x90a1, 0x8f1e, 0x8dab, 0x8c4b, 0x8afc,
   0x89bf, 0x8894, 0x877c, 0x8676, 0x8583, 0x84a3, 0x83d7, 0x831d, 
   0x8276, 0x81e3, 0x8163, 0x80f7, 0x809e, 0x8059, 0x8028, 0x800a,
   0x8000, 0x800a, 0x8028, 0x8059, 0x809e, 0x80f7, 0x8163, 0x81e3, 
   0x8276, 0x831d, 0x83d7, 0x84a3, 0x8583, 0x8676, 0x877c, 0x8894,
   0x89bf, 0x8afc, 0x8c4b, 0x8dab, 0x8f1e, 0x90a1, 0x9236, 0x93dc, 
   0x9593, 0x975a, 0x9931, 0x9b18, 0x9d0e, 0x9f14, 0xa129, 0xa34c,
   0xa57e, 0xa7be, 0xaa0b, 0xac65, 0xaecd, 0xb141, 0xb3c1, 0xb64c, 
   0xb8e4, 0xbb86, 0xbe32, 0xc0e9, 0xc3aa, 0xc674, 0xc946, 0xcc22,
   0xcf05, 0xd1ef, 0xd4e1, 0xd7da, 0xdad8, 0xdddd, 0xe0e7, 0xe3f5, 
   0xe708, 0xea1e, 0xed38, 0xf055, 0xf375, 0xf696, 0xf9b9, 0xfcdc,
};

//-----------------------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------------------

void main (void) 
{
   PCA0MD &= ~0x40;                    // 禁用看门狗定时器

   OSCILLATOR_Init ();                 // 初始化振荡器
   PORT_Init ();                       // 初始化端口
   IDA0_Init ();                       // 初始化 IDAC

   Timer3_Init(SYSCLK/SAMPLE_RATE_DAC);// 使用 Timer3 作为更新调度器	
      
   EA = 1;                             // 使能全局中断
      
   while(1){} 
} // main 结束

//-----------------------------------------------------------------------------
// 初始化例程
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// OSCILLATOR_Init
//-----------------------------------------------------------------------------
//
// 返回值：无
// 参数：  无
//
// 此例程初始化系统时钟，使用内部 24.5MHz 振荡器作为时钟源。
// 同时使能缺失时钟检测复位。
//
//-----------------------------------------------------------------------------
void OSCILLATOR_Init (void)
{
   OSCICN  = 0x83;                     // 设置时钟为 24.5 MHz
   RSTSRC  = 0x04;                     // 使能缺失时钟检测器
}

//-----------------------------------------------------------------------------
// PORT_Init
//-----------------------------------------------------------------------------
//
// 返回值：无
// 参数：  无
//
// P0.1     (在交叉开关中跳过)      IDA0 输出引脚
//-----------------------------------------------------------------------------
void PORT_Init (void)
{
   P0SKIP   = 0x02;                    // 跳过用于 IDA0 的 P0.1
   P0MDIN  &= ~0x02;                   // 将 P0.1 配置为模拟引脚

   XBR0     = 0x00;                   
   XBR1     = 0x40;                    // 使能交叉开关和弱上拉 
}

//-----------------------------------------------------------------------------
// Timer3_Init
//-----------------------------------------------------------------------------
//
// 返回值：无
// 参数：
//   1)  int counts - 计算出的定时器溢出率
//                    范围是整数的正范围：0 到 32767
//
// 配置 Timer3 以 <counts> 指定的间隔自动重载，
// 使用 SYSCLK 作为时基。使能中断。
//-----------------------------------------------------------------------------
void Timer3_Init(int counts)
{
   TMR3CN  = 0x00;                     // 复位 Timer 3，设置为 16 位模式
   CKCON  |= 0x40;                     // 使用系统时钟
   TMR3RL  = -counts;                  // 初始重载值

   TMR3    = 0xffff;                   // 设置定时器自动重载
   EIE1   |= 0x80;                     // 使能 Timer 3 中断
   TMR3CN  = 0x04;                     // 启动 Timer 3
}

//-----------------------------------------------------------------------------
// IDA0_Init
//-----------------------------------------------------------------------------
//
// 返回值：无
// 参数：  无
//
// 使能 VREF 和 IDAC0
//-----------------------------------------------------------------------------
void IDA0_Init (void)
{
   REF0CN = 0x03;                      // 使能内部 VREF 发生器

   IDA0CN = 0xB2;                      // 使能 IDAC0，满量程 2.0 mA
                                       // 输出；在 Timer3 溢出时更新
}

//-----------------------------------------------------------------------------
// 中断服务例程
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// Timer3_ISR
//-----------------------------------------------------------------------------
//
// 此中断服务程序在 Timer3 溢出时被调用。Timer3 设置为自动重载模式，
// 在本例中用于调度 DAC 输出采样率。
// 注意，在此中断服务程序调用期间写入 IDAC 的值，
// 实际上会在下一次 Timer3 溢出时传输到 IDAC。
//
//-----------------------------------------------------------------------------
void Timer3_ISR (void) interrupt 14 using 3
{
  
   static unsigned phase_acc = 0;      // 保存相位累加器
   
   int temp1;                          // 临时值，在写入 IDAC 之前
                                       // 经过 3 个阶段

   int code *table_ptr;                // 指向查找表的指针
   
   lng temporary_long;                 // 保存 16 位乘法的结果

   TMR3CN &= ~0x80;                    // 清除 Timer3 溢出标志
	
   table_ptr = SINE_TABLE;         
   
   phase_acc += PHASE_ADD;             // 递增相位累加器 
                                   
   
   // 将 <temp1> 的值设置为 DAC1 在满量程幅度下的下一个输出；
   // 范围为 +32767, -32768 
   
   // 读取表值
   temp1 = *(table_ptr + (phase_acc >> 8)); 
                    
   // 调整增益
   temporary_long.Long = (long) ((long)temp1 * (long)AMPLITUDE); 
   
   temp1 = temporary_long.Int[0];      // 等同于 temporary_long >> 16

   // 添加直流偏置，使范围变为 0 到 65535
   // 注意：与 0x8000 进行异或，将双极性量转换为
   // 单极性量。

   IDA0 = 0x8000 ^ temp1;
}

//-----------------------------------------------------------------------------
// 文件结束
//-----------------------------------------------------------------------------